{
  "title": "17th April 2018",
  "subtitle": "Transparency and More Coins!",
  "slug": "17th-april-2018",
  "section": "updates",
  "url": "/info/updates/17th-april-2018/",
  "body": "**TL;DR:**\r\n* Got some spare hash? **[Mine some Zelcash](/)**!  It's live and blocks are already being mined.\r\n* Higher diff ports for peeps with a little more power in their rigs\r\n* We're combatting scammy mining pool fees with transparency \r\n\r\n### Zelcash now available\r\n\r\nA promising project that's promising a development platform, a Proof-of-Stake element in the form of masternodes and of, of course is a mineable Proof-of-Work, equihash coin. Other key info:\r\n\r\nBlock time: 2mins  \r\nBlock reward: 150 ZEL  \r\nTotal ZEL Supply: 210,000,000  \r\n[Website](https://zel.cash/) | [Announcement](https://bitcointalk.org/index.php?topic=2853688.0)\r\n\r\n<h4>Start mining Zelcash</h4>|  \r\n------|-------\r\nhost | **stratum+tcp://lambomoon.club**\r\nport | **3044** (low diff)\r\nport | **3144** (10000+ diff)\r\npassword | _none_ ( for now &#128521; ) \r\n\r\n### Speaking of connections...\r\n\r\nThere are some additional ports available for connection across all the coins (including the newly added Zelcash). Connect to the **31&ast;&ast;** port (instead of the*30&ast;&ast;* one) to start mining at a higher difficulty. The ports still use *variable *difficulty, so the optimum level will be set as you mine as usual. The new port just means that if you've got more hash, you can get to the optimium difficulty for your rig a little quicker, therefore getting more shares and potentially more reward. We do it for the people! \r\n\r\n### Let's talk about transparency\r\n\r\nHumans are often afraid to be honest because they fear the repercussions: being attacked or ridiculed; being judged; being wrong. But one of the beautiful things about cryptocurrencies is that they allow everyone to see what's happening. In other words: there's a degree of transparency that you don't get with fiat currencies.\r\n\r\nMining pools often claim to be transparent too, because they allow miners to see the coins paid out. But this isn't transparency, it's convenience. We're trying to do something a little different with LamboMoon: provide understanding of the fee structure – the *why* behind it – and evidence that what is advertised on the site *is the fee that is actually taken*. This is why a new tab has been added to the miners page: [Earnings](/#earnings).\r\n\r\n#### The pool earnings tab\r\n\r\n![Transparency at its finest? OK, probs not...](/gin-data/images/1523996117808-lm-earnings.png \"Pool earnings\")\r\n\r\nHere you'll see the dollar value of the coins paid out to you, the miners, each month, the value of the fee taken from the block reward, *as well as* the monthly cost of running the pool.  The hope is that this, along with the [pool fee info](/info/fees-donations/ \"Fees and Donations\"), goes a way to establishing more understanding and trust in LamboMoon, as well as encouraging other pools to offer a similar level of transparency, so that miners don't get caught out by scams.\r\n\r\nTo learn more about how the new tab and its calculations visit the [pool transparency page](/info/transparency/ \"Transparency\").",
  "featured-image": {
    "src": ""
  },
  "summary": "",
  "created": "2018-04-17T13:55:08.016Z",
  "updated": "2018-04-17T20:17:20.370Z",
  "published": "2018-04-17T14:28:13.201Z",
  "contentType": "page",
  "id": "B1Eahum2f"
}