{
  "title": "What is BitcoinZ (BTCZ)?",
  "subtitle": "Equihash altcoin mining",
  "slug": "what-is-bitcoinz-btcz",
  "section": "news",
  "url": "/news/what-is-bitcoinz-btcz/",
  "body": "## Introduction to BitcoinZ\r\n\r\nBitcoinZ (BTCZ) is a mineable equihash altcoin based on ZCash (ZEC) that allows fast, private, low-cost transactions. It had no premine, no ICO and there's no dev tax or founders reward. It's completely community-driven and the focus is decentralization, a theme that runs through every aspect of BitcoinZ. \r\n\r\nBitcoinZ Summary ||\r\n-|-\r\nName | BitcoinZ\r\nTicker | BTCZ\r\nAlgorithm | Equihash\r\nType | Proof of Work (PoW)\r\nSupply | 21 Billion\r\nBlock Reward | 12,500 BTCZ\r\nBlock Size | 2 MB\r\nBlock time | 2.5 minutes\r\nICO | None\r\nPremine | None\r\nFounders Reward | None\r\n\r\n## BitcoinZ's technology\r\n\r\nBitcoinZ uses the equihash algorithm, which is an algorithm known for its ASIC (**A**pplication **S**pecific **I**ntegrated **C**ircuit) resistance. This means network hash is unlikely to be centralized with a few high-end ASIC miners. Anyone with a GPU or CPU can mine and receive BTCZ.\r\n\r\nThe other key piece of technology in use is zk-SNARKS, which allows transactions to be stored on the blockchain completely encrypted, while still allowsing for verification and validation. In simpler terms, transactions can be proved valid without revealing any information about them. This allows for anonymous transactions along side standard transparent transactions.\r\n\r\n## BitcoinZ's latest developments\r\n\r\n**BTCZ.me** allows users to share a simple URL instead of a complicated wallet address. You just send the person who wants to pay you to btcz.me/*username*  and they can scan a QR code (or copy your address manually). This is a great convenience and adds to the ease of use of BitcoinZ.\r\n\r\n**TXTZ** allows you to send BTCZ via SMS. BitcoinZ development team appears to be the pioneers with this particular service. It's a significant step forward because it means even those with non-smartphones use BTCZ on mobile.\r\n\r\n## BitcoinZ team\r\n\r\nWhile there are regular contributors to the project, and a small group who might be considered the core developers , the \"team\" is completely decentralized. Anyone with the skills can contribute to the project. And they do, from all over the world. Contributions mainly come from volunteers, however bounties – funded by the community – are also offered for key work that is considered valuable and/or a high priority for the advancement of the BitcoinZ.\r\n\r\n## BitcoinZ community\r\n\r\nSpeaking of community, BitcoinZ has one of the friendliest you'll encounter in crypto.  It's active, open, and very accessible. In-fighting seems to be non-existent and trolling is minimal. It can be accessed on Slack, Discord and Telegram, with messages from the *#general*  chat shared across all three.\r\n\r\nWhile there are certainly more active members than others, it doesn't feel like anyone is \"in charge\". All decisions about the project are made by the community by voting on them via a proposal system. If there's no proposal or no vote in favour, it basically doesn't happen. Decisions are decentralized.\r\n\r\n## Mining BitcoinZ\r\n\r\nThere are several mining pools available for BitcoinZ, most of which can be found on [their forum](https://forum.btcz.rocks/t/pools-that-love-the-bitcoinz-community/51). A couple of places to calculate potential profits are: \r\n\r\n* [Crypto Coinz](https://www.crypto-coinz.net/crypto-calculator/)\r\n* [Crypto Rival](https://cryptorival.com/calcs/bitcoinz/)\r\n\r\nIn terms of decentralization, it's probably the only area where BitcoinZ is struggling a little. Like many newer PoW coins, network hash often accumulates on the most well-known pools (to learn why this is bad, [read this](https://lambomoon.club/info/#put-your-hash-here)) .\r\n\r\n## Trading BitcoinZ\r\n\r\nBitcoinZ is currently available on BTC-Alpha, Trade Satoshi, Stocks.exchange, Graviex and BarterDEX. It's also due to be listed on Coinbene in May 2018.\r\n\r\n## Thoughts on BitcoinZ\r\n\r\nOptional privacy, fast transactions and low fees all make BitcoinZ pretty appealing. The strong community, active development and growing list of features and services indicate a coin with great room to grow in value, as well as become more widely adopted. The high coin supply might not be appealing to some, but it certainly makes prices easier to reason about for microtransactions. Plus, it means that everyone in the world can own at least one BTCZ, which is inline with the spirit of the coin and community, which are both very inclusive.\r\n\r\n\r\n### [Mine BitcoinZ with LamboMoon](https://lambomoon.club)\r\nConnection details | &nbsp;\r\n-|-\r\nLow difficulty|*stratum+tcp://lambomoon.club:3035*\r\nHigher difficulty|*stratum+tcp://lambomoon.club:3135*\r\nUsername|*BTCZ wallet address*\r\nPassword|*None*",
  "featured-image": {
    "src": ""
  },
  "summary": "With a focus on decentralization, BitcoinZ hopes to be the key to financial freedom across the globe.",
  "blog": "1",
  "created": "2018-05-03T15:07:21.440Z",
  "updated": "2018-05-03T15:08:29.647Z",
  "published": "2018-05-03T15:08:29.647Z",
  "contentType": "page",
  "id": "Bk-hHsuaz"
}