{
  "title": "Info",
  "subtitle": "What you need to know",
  "slug": "index",
  "section": "",
  "url": "/info/",
  "body": "[LamboMoon](https://lambomoon.club) is an anonymous, altcoin mining pool.  *Stealthily* earn block rewards while contributing to the health and stability of the network. Block rewards are paid early and often. Just take your pick and [start mining](/)!\r\n\r\n## Put your hash here\r\n\r\nDon't believe the hype! Although you're likely to see rewards quicker by mining on the largest pools, the rewards will be _much smaller_. This is because you end up sharing the same-sized pie with far more miners. Having said that, in the long run the payouts tend to average out between larger and smaller pools. So, long-term, you're wallets will get just as fat by mining here. So why not?\r\n\r\n**On a serious note: ** by mining on smaller pools like LamboMoon, you help to ensure that the network hash is more evenly distributed. This prevents hashing power from becoming centralised, and decreases the risk of a majority attack (AKA 51% attack).\r\n\r\nAlso, in case you didn't know, proceeds from the [pool fee](/info/pool-fee/ \"Pool Fee\") are happily donated to coins hosted here (those with a known donation address). Not only that, but time and effort is also contributed to some of the coin projects. LamboMoon is here for, and part of, the crypto community.\r\n\r\n## Get in touch\r\n\r\nGot questions? Something wrong? Just feel like shootin' the breeze? If you feel the need to reach out, you can get in touch via the following places:\r\n\r\n* **Twitter**: [@LamboMoonClub](http://twitter.com/LamboMoonClub)\r\n* **Discord**:  _lnoir / lambomoon.club#7535_\r\n* **Slack**: _lnoir / lambomoon.club_\r\n\r\n*AND* (of course), if none of those float your boat, you can look out for _LamboMoonClub_ in the[ mining page](/) chat panel.\r\n",
  "featured-image": {
    "src": ""
  },
  "summary": "",
  "created": "2018-04-10T16:09:22.981Z",
  "updated": "2018-04-10T22:10:20.136Z",
  "published": "2018-04-10T16:09:37.632Z",
  "contentType": "page",
  "id": "Bks2Zv5iG"
}