{
  "title": "Transparency",
  "subtitle": "How are pool earnings calculated?",
  "slug": "transparency",
  "section": "",
  "url": "/info/transparency/",
  "body": "If you've spent time on LamboMoon recently you may have noticed the *[Earnings tab](/#earnings \"Earnings tab\")*. This is where LamboMoon shows you what most other pools don't: its revenue. The revenue is broken down simply into two categories: the amount paid to miners and the amount paid to the pool. Overlayed on top of this is the running cost  of the pool.\r\n\r\n### How is the revenue calculated\r\n\r\nThe formulas are pretty simple but, due to current (but hopfeully not permanent) technical limitations, they involve a teeny-weeny bit of approximation. Below is the formula for the dollar amount paid to miners:\r\n\r\n**$$$ paid to miners** = *Value of Coin (VoC)  &ast; Coins Paid to Miners (CPM)  &ast; $BTC*  \r\n\r\n*VoC* and *$BTC*  are the values of the coins and BTC (respectively) arount the time the payments are made. However, this feature only went live on 17th April 2018, so all payments before this date are based on values retrieved from Coin Market Cap and exchanges on 16th April 2018. Going forward, the coin values will generally be the most recent for each month. Of course, coin values fluctuate, so the overall revenue will always be approximate.\r\n\r\n#### What about the pool fee?\r\n\r\nGreat question! The amount the pool receives is derived from *CPM* (above). This is because retrieving the *actual* fee the pool receives for each coin, in each month, is programmatically more problematic than retrieving the *CPM*.  And because modifying the core software can be a severe maintenance headache, a more sane approach is taken:\r\n\r\n** Estimated fee from block-reward (EFB) ** = *( CPM / 95 ) &ast; 5 *  \r\n**$ paid to pool** = VoC &ast; EFB &ast; $BTC\r\n\r\nPretty simple mathematics, but it gives our miners a great picture of what's happening with the pool and the coins on it. Coupled with the monthly cost of running the pool (the current month is always an estimate), it's clear to see if the pool is in profit or deficit. At the time of writing the pool is operating at a loss. Eventually, though, it will become self-sustaining and we'll be able to [incrementally decrease the pool fee](/info/fees-donations/ \"Fees and Donations\") until we reach **1%**.",
  "featured-image": {
    "src": ""
  },
  "summary": "",
  "created": "2018-04-17T13:01:16.633Z",
  "updated": "2018-05-03T14:56:08.325Z",
  "published": "2018-04-17T14:34:21.262Z",
  "contentType": "page",
  "id": "H1Smg_X2z"
}