{
  "title": "News Bites: Bitmain vs Equihash",
  "subtitle": "08 May 2018",
  "slug": "news-bites-bitmain-vs-equihash",
  "section": "news/2018/may/08",
  "url": "/news/2018/may/08/news-bites-bitmain-vs-equihash/",
  "body": "**It's been a busy few days. Here are some highlights of what you might have missed, if you were under a rock or doing a digital detox.**\r\n\r\n## [Bitmain releases Z9 Mini ASIC targeting Equihash](https://twitter.com/BITMAINtech/status/992034662875779072)\r\n**Bitmain sent shock waves through the crypto community when it announced the release of a new ASIC miner for Equihash coins: the [Z9 Mini](https://shop.bitmain.com/product/detail?pid=00020180503154806494uGcSyiu806FD).  Bitmain limited purchases of the Z9 to one per person \"to prevent hoarding\", but that didn't stop them rapidly filling their pre-order quota — it's now sold out.**\r\n\r\n*One has to question the true motivation behind the \"one per person\" limit. No doubt Bitmain have been putting the Z9 to work for several weeks and will continue to do so. I suspect some of those who purchased the Z9 Mini will be receiving a very well-tested machine... Also, let's just take a moment to take in the \"Mini\" in the name. There *has to be* a big brother coming  in the not-to-distant future.*\r\n\r\n*Anyway, it looks like Equihash isn't quite so ASIC resistant. Discussions are happening throughout the commnunities of the various Equihash coins to determine their fates. Stay tuned.*\r\n___\r\n## [ByteCoin (BCN) not-so-quietly lists on Binance](https://twitter.com/Bytecoin_BCN/status/993745568013914112)\r\n**Stocks.exchange users trading ByteCoin (BCN) may not have noticed, but [ByteCoin was listed on Binance](https://www.binance.com/trade.html?symbol=BCN_BTC) today, 8th May 2018, and quickly climbed to about four times the price of the coin's value on Stocks.exchange.**\r\n\r\n*Any smart traders out there with their fingers on the pulse would be looking to gain a quick win by buying cheap on Stocks.exchange and selling for a healthy profit on Binance. At least, that's what I'd probably do...*\r\n___\r\n## [EOS releases EOS Dawn 4.0](https://medium.com/@bytemaster/introducing-eosio-dawn-4-0-f738c552879)\r\n**EOS has hit another milestone with the release of EOS Dawn 4.0. It comes with significant improvements around inter-blockchain communication (IBC) and increased stability of the software. The release comes just a month after Dawn 3.0, with the EOS 1.0 just around the corner, due to be available at the beginning of June 2018. Dive into the Dawn 4.0 details [here](https://medium.com/@bytemaster/introducing-eosio-dawn-4-0-f738c552879).**\r\n\r\n*Dan Larimer and his team continue to impress with regular releases and a clear progression towards a platform that looks like it will deliver on its promise of significant scalability. The increasing interest in EOS is reflected by its increasing value: it went from around $0.80 dollars in value in August 2017 to as high as $20 in April 2018. Early investors are no doubt sleeping pretty soundly over this one.*\r\n\r\n*If you don't know anything about the EOS platform, you're late to the game, but perhaps not *too* late. Learn more about it [here](https://www.eos.io/) or [here](https://www.dailydot.com/debug/what-is-eos-dapps/).*",
  "featured-image": {
    "src": ""
  },
  "summary": "Bitmain goes after Equihash, ByteCoin gets listed on Binance and EOS Dawn 4.0 is released.",
  "blog": "1",
  "amp": "1",
  "created": "2018-05-08T10:59:27.507Z",
  "updated": "2018-05-08T12:51:06.389Z",
  "published": "2018-05-08T12:44:42.284Z",
  "contentType": "page",
  "id": "H1wMXbJAf"
}