{
  "title": "What is VoteCoin (VOT)?",
  "subtitle": "Equihash altcoin mining",
  "slug": "what-is-votecoin-vot",
  "section": "news",
  "url": "/news/what-is-votecoin-vot/",
  "body": "An equihash altcoin with masternodes and big plans for the future.\r\n\r\n## Introduction to VoteCoin\r\n\r\nVoteCoin (VOT) is a fork of ZCash (ZEC). It has a fast block time, cheap transactions, active dev team and community, and is the only equihash coin with masternodes.\r\n\r\nVoteCoin Summary ||\r\n-|-\r\nName | VoteCoin\r\nTicker | VOT\r\nAlgorithm | Equihash\r\nType | Proof of Work (PoW)\r\nSupply | 220 Million\r\nBlock size | 2 MB\r\nBlock time | 2.5 minute\r\nBlock reward | 125 VOT\r\nICO | 10 Million VOT, 1 BTC = 50,000 VOT (ended 21 Oct. 2017)\r\nPremine | None\r\nFounders Reward | None\r\n\r\n## VoteCoin's technology\r\n\r\nVoteCoin is an equihash coin, so it has the ASIC (**A**pplication **S**pecific **I**ntegrated **C**ircuit) resistance of coins like BitcoinZ and ZelCash. This means network hash is unlikely to be centralized with a few high-end ASIC miners. Anyone with a GPU or CPU can mine and receive VOT.\r\n\r\nIt also uses zk-SNARKS, which allows transactions to be stored on the blockchain completely encrypted, while still allowsing for verification and validation. In simpler terms, transactions can be proved valid without revealing any information about them. This allows for anonymous transactions along side standard transparent transactions.\r\n\r\n## VoteCoin's latest developments\r\n\r\n**Masternodes** went live in April 2018 and started paying out on the VoteCoin network. This makes VoteCoin unique as it's the first equihash coin to implement masternodes, of which there are now over 150 across the  globe.  \r\n___\r\n> #### What are masternodes?\r\n> The function of masternodes varies between implementations. In some cases they perform special functions on the network that aren't handle by regular nodes. At the very least they help strengthen the network because they're (theoretically) always available, sharing their peers with the network, and they're constantly maintained. Because they play an important role, running a masternode requires *stake*, but in return the owner is paid a portion of the block reward and/or fees.  \r\n\r\n___  \r\n\r\n\r\nMasternodes provide an alternative way to earn coins without having to mine them. Instead of buying mining equipment, you set up a masternode on small server, stake your coins (10,000 VOT) and watch the funds roll in. That's the simple version. Learn more about setting up VoteCoin masternodes on their [website](https://VoteCoin.org/how-to-setup-a-masternode/).\r\n\r\nSomething to note about the implementation of masternodes in VoteCoin: it reduces the payout to miners. While the block reward may be 20 VOT, *35%* of that (7 VOT) goes to the owner of the maternode. The percentage taken by the masternode increases by 10% every 43,200 blocks until it reaches a 50/50 split between masternode and miner(s). Of course, if the price continues to increase (and it looks like it will), mining VoteCoin still looks like a worthwhile investment.\r\n\r\n## VoteCoin team\r\n\r\nThe core team is very friendly and communicative. They actively participate in Discord, Telegram and on the [BitcoinTalk announcement](https://bitcointalk.org/index.php?topic=2630198.0) (which is over 100 pages now). *Txid* (the lead developer) regularly pushes updates, works with the community to understand any potential problems, and is quick to fix any issues that arise.\r\n\r\n## VoteCoin community\r\n\r\nThe VoteCoin community is very active on Discord, Telegram and Twitter, and constantly growing. The project always feels like it has a lot of support, and interest is growing, particularly after recent masternode launch. If you want to get a real feel for this coin and its potential, spend time in one of the chat groups.\r\n\r\n## Mining VoteCoin\r\n\r\nYou can [mine VoteCoin on LamboMoon](https://lambomoon.club). For further options you can visit the VoteCoin [website](https://VoteCoin.org). They also have a dedicated mining profitability calculator, which can be found [here](https://VoteCoin.org/calculator/). \r\n\r\nLike other smaller coins, network hash tends to end up consolidating on larger pools, which is bad for any cryptocurrency aiming for decentralization. Visit our page to learn a little more about the [importance of decentralized mining](https://lambomoon.club).\r\n\r\n## Trading VoteCoin\r\n\r\nVoteCoin is currently available on SouthXchange, Stocks.exchange, Graviex and BarterDEX.\r\n\r\n## Thoughts on VoteCoin\r\n\r\nVoteCoin's implementation of masternodes is interesting, if not somewhat controversial.  Masternodes can leave those who are poorer at a disadvantage, because of the coins required upfront to activate them. But with the value of VoteCoin increasing, even with the cut taken by masternodes, if the difficulty and network hash is right, mining can still be very profitable.\r\n\r\n\r\n### [Mine VoteCoin with LamboMoon](https://lambomoon.club)\r\nConnection details|&nbsp; \r\n-|-\r\nLow difficulty|*stratum+tcp://lambomoon.club:3040*\r\nHigher difficulty|*stratum+tcp://lambomoon.club:3140*\r\nUsername|*VoteCoin wallet address*\r\nPassword|*None*",
  "featured-image": {
    "src": ""
  },
  "summary": "VoteCoin is a platform for decentralized and anonymous voting, and it's the only one of its kind.",
  "blog": "1",
  "created": "2018-05-04T07:47:44.191Z",
  "updated": "2018-05-04T07:49:03.741Z",
  "published": "",
  "contentType": "page",
  "id": "r1OQl9YTG"
}