{
  "title": "What is VoteCoin (VOT)?",
  "subtitle": "Equihash altcoin mining",
  "slug": "what-is-votecoin-vot",
  "section": "news",
  "url": "/news/what-is-votecoin-vot/",
  "body": "## Introduction to VoteCoin\r\n\r\nVoteCoin (VOT) is a equihash coin designed for the purpose of decentralized voting. It can be used for a variety of applications including: public elections, polls, crowd-funding and even betting.\r\n\r\nVoteCoin Summary ||\r\n-|-\r\nName | VoteCoin\r\nTicker | VOT\r\nAlgorithm | Equihash\r\nType | Proof of Work (PoW)\r\nSupply | 220 Million\r\nBlock size | 2 MB\r\nBlock time | 2.5 minute\r\nBlock reward | 125 VOT\r\nICO | 10 Million VOT, 1 BTC = 50,000 VOT (ended 21 Oct. 2017)\r\nPremine | None\r\nFounders Reward | None\r\n\r\n## VoteCoin's technology\r\n\r\nVoteCoin is a fork of ZCash (ZEC) and inherits the equihash algorithm, along with it's (possibly fading) benefits. It also uses zk-SNARKS, which is the technology that allows for anonymous voting in elections and polls.\r\n\r\n## VoteCoin's latest developments\r\n\r\n**GUI wallet v1.0.0-rc1** release candidate was made available in March 2018 for Winows, OS X and Linux. Along side being able to send and receive transactions, it also includes a *Vote*  section which can be used to anonymously participate in polls and betting.\r\n\r\n## VoteCoin team\r\n\r\nThe [VoteCoin core team](https://www.votecoin.site/#carousel-testimonials) is made up of three developers (the lead being Tomas Matejicek, author of the pocket-sized Linux distro, Slax), and a designer. They seem to be rather elusive and don't seem to converse directly with the community much (if at all) on the Discord, which is a shame. *@thesudio* , who *seems* to be the Discord community manager and admin as of April 2018, appears to be a proxy to the development team, so there is *indirect* access to them, at least.\r\n\r\n## VoteCoin community\r\n\r\nThe VoteCoin Discord group isn't the most active, but since *@thesudio* took control of the community activity has increased. It has also become a lot more organised. \r\n\r\n## Mining VoteCoin\r\n\r\nYou can [mine VoteCoin on LamboMoon](#mine-votecoin-lambomoon). For further options you can visit the VoteCoin [BitcoinTalk announcement](https://bitcointalk.org/index.php?topic=2137705.0), or [join their Discord group](https://discord.gg/YFQ7U3y).\r\n\r\nNetwork hash has a tendency to consolidate on much larger pools, so choose carefully where you mine. Visit our page to learn a little more about the [importance of decentralized mining](https://lambomoon.club).\r\n\r\n## Trading VoteCoin\r\n\r\nVoteCoin is currently available to trade on TradeSatoshi and Crex24. They also have a Binance application in progress.\r\n\r\n## Thoughts on VoteCoin\r\n\r\nVoteCoin has great potential. It's one of only a couple of established decentralised voting platforms in the crypto space (another being *Decision Token* from Horizon State). It's definitely feasible and even likely that there'll be wider-spread adoption of decentralised voting platforms to ensure verifiable and incorruptible voting. Of course, the qualities that make VoteCoin appealing to some will make it unappealing to others. But its support for betting significantly broadens the possibilities for this coin beyond polls and elections, so it will be very interesting to see where its journey leads.\r\n\r\n\r\n### [Mine VoteCoin with LamboMoon](https://lambomoon.club)<span id=\"mine-votecoin-lambomoon\"></span>\r\nConnection details|&nbsp; \r\n-|-\r\nLow difficulty|*stratum+tcp://lambomoon.club:3040*\r\nHigher difficulty|*stratum+tcp://lambomoon.club:3140*\r\nUsername|*VoteCoin wallet address*\r\nPassword|*None*",
  "featured-image": {
    "src": ""
  },
  "summary": "VoteCoin is a platform for decentralized and anonymous voting, and is one of very few of its kind.",
  "blog": "1",
  "amp": "1",
  "created": "2018-05-04T07:47:44.191Z",
  "updated": "2018-05-07T10:03:23.597Z",
  "published": "2018-05-04T10:47:18.541Z",
  "contentType": "page",
  "id": "r1OQl9YTG"
}