{
  "title": "News Bites: Unicef wants your hash",
  "subtitle": "02 May 2018",
  "slug": "news-bites-unicef-wants-your-hash",
  "section": "news/2018/may/02",
  "url": "/news/2018/may/02/news-bites-unicef-wants-your-hash/",
  "body": "# [UNICEF wants your hash](https://www.ccn.com/unicef-wants-to-use-your-cpu-to-mine-monero-to-raise-funds-for-children/)\r\n**UNICEF Australia has launched a [website](https://www.thehopepage.org/) that allows users to donate their CPU power to cryptocurrency mining. They'll be using Coinhive tech to mine Monero (with the user's permission), with funds going towards the charity's cause.**\r\n\r\n> Can't knock it. They're utilising modern tech to offer people another way to contribute (and give them fewer excuses not to). Other charities are sure to follow suit.*\r\n\r\n# [Bitcoin goes stealth (again)](https://themerkle.com/what-is-anonymous-bitcoin-cryptocurrency)\r\n**Anonymous Bitcoin (BTCA) aims to be the faster, privacy-focused lovechild of Bitcoin (BTC) and ZClassic (ZCL). It'll be a dual fork from both currencies and utilise the zkSnarks privacy that ZCL inherited from ZCash (ZEC).**\r\n\r\n> For fork's sake... Bitcoin Private, anyone? Plus, there are plenty other privacy coins already.  I'm skeptical that there'll be any vast improvement or value over existing options such as BTCP, XMR and ZEC, or lesser known and undervalued coins such as BitcoinZ (BTCZ) and SnowGem (XSG).*\r\n\r\n# [Iran bans Telegram](https://www.yahoo.com/news/iran-bans-popular-telegram-messaging-app-220604279.html)\r\n**Iran have banned Telegram due to the belief it is used to fuel civil unrest.  Meanwhile, an [experimental state cryptocurrency](https://www.reuters.com/article/uk-crypto-currency-iran/iran-cryptocurrency-project-on-track-despite-cenbank-ban-minister-says-idUSKBN1HZ0O6) is ready for testing, despite Iran's central bank putting a ban on trading cryptocurrencies of any sort.**\r\n\r\n> Ban all the things! Ugh. And state cryptocurrencies... Another way to maintain control? Probably. Once it becomes the standard way to transact, the next logical step might then be to ban the use of \"untrusted\" (non-government issued) cryptocurrencies — to protect the people, of course.*\r\n\r\n# [UCL and IOTA break up](https://cointelegraph.com/news/university-college-london-cuts-ties-with-iota-cites-support-for-open-security-research)\r\n**University College London have broken ties with IOTA Foundation, seemingly over a disputed that dates back to July 2017, when a vulnerability in IOTA source code was made public. All references to IOTA have been removed from their site and a statement released.**\r\n \r\n# [Japan's  regulators want privacy coins gone](https://www.forbes.com/sites/adelsteinjake/2018/04/30/japans-financial-regulator-is-pushing-crypto-exchanges-to-drop-altcoins-favored-by-criminals/#7e2aa3541b8a)\r\n**Regulators in Japan are floating the idea of banning privacy coins on crypto exchanges. Currencies such as Monero (XMR) and Dash (DASH) are considered 'highly problematic' because their privacy features make them difficult, if not impossible, to trace, making them more appealing to criminals than the once favoured Bitcoin (BTC).**\r\n\r\n> It's easy to see regulatory bodies in other countries such as the US and UK toying with a similar idea. But the likelihood is that, if there's a clampdown on privacy coins on centralised exchanges, those looking to use them will migrate to decentralised exchanges, which are far more difficult to regulate.*\r\n\r\n\r\n\r\n",
  "featured-image": {
    "src": ""
  },
  "summary": "Unicef want's  you to donate your CPU to mine XMR, another Bitcoin fork is on the way and Iran bans Telegram.",
  "blog": "1",
  "amp": "1",
  "created": "2018-05-01T10:29:09.994Z",
  "updated": "2018-05-08T12:47:56.396Z",
  "published": "2018-05-02T10:42:48.543Z",
  "contentType": "page",
  "id": "rkR_ZpSTM"
}